{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/log global IHME.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Apr 2021, 07:39:06
{txt}
{com}. 
. ***************************************************************************
. * This is "do globalcovid IHME.do"
. 
. * Project: Rapid review of estimates of global COVID-19
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-04-14
. 
. * OBJECTIVE: Get, prepare, and combine component studies' estimates
. 
. * This update   20210414             // update date of these codes
. * Date update   20210409             // update date of study estimates used here
. * Date coverage 04feb2020,01aug2021  // dates covered by study estimates
. ***************************************************************************
. 
. 
. clear 
{txt}
{com}.  
. *****************************
. 
. * get IHME estimates
. 
.  
. copy https://ihmecovid19storage.blob.core.windows.net/latest/ihme-covid19.zip ihme-covid19.zip
{txt}
{com}. // copy https://ihmecovid19storage.blob.core.windows.net/archive/2021_04_09/ihme-covid19.zip ihme-covid19.zip // uncomment when /2021_04_09/ is moved to /archive/
. unzipfile ihme-covid19.zip, replace
{res}{txt}    inflating: 2021_04_09/best_masks_hospitalization_all_locs.csv
    inflating: 2021_04_09/IHME_COVID_19_Data_Release_Information_Sheet.pdf
    inflating: 2021_04_09/reference_hospitalization_all_locs.csv
    inflating: 2021_04_09/Summary_stats_all_locs.csv
    inflating: 2021_04_09/worse_hospitalization_all_locs.csv
successfully unzipped ihme-covid19.zip to current directory

{com}. erase ihme-covid19.zip
{txt}
{com}. 
. 
. ******************************
. 
. * import csv files
. 
. 
. /*
> 
> *!!! IMPORTANT NOTE !!!: 
> 
> Make sure that among different estimations updates which might be downloaded into this directory over a course of more than one to two weeks, 
> the only update directory whose directory name is like 2021_04_09 should be the latest estimate. 
> Might want to manually rename the previous directories.
> 
>         
> * Note on scenario changes in IHME COVID-19 model updates:
> 
> Since early 2020, IHME COVID-19 model has had three versions of their set of scenarios. 
> The very first version had 3 scenarios, a next version had 6 scenarios and included vaccines, 
> another version modified vaccine scenarios and added new variants, 
> and as of updates 2021 02 25 and 2021 03 06, scenarios are back to the very first version with 3 scenarios. 
> 
> Once additional scenarios might be added, the code parts below would need to be updated in order to be able 
> to intake the new files' names. 
> 
> */
. 
. 
. dis "`c(username)'"
{res}farshadpourmalek
{txt}
{com}. local usrnam = "`c(username)'"
{txt}
{com}. di "`usrnam'"
{res}farshadpourmalek
{txt}
{com}. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
.         local path "/Users/`usrnam'/Downloads/globalcovid-main/20210414/code/IHME" 
.         di "`path'"
{res}/Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 local path "C:\Users\\`usrnam'\Downloads\globalcovid-main\20210414\code\IHME"
{txt}
{com}.     di "`path'"
{res}/Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME
{txt}
{com}. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
.         local path "/Users/`usrnam'/Downloads/globalcovid-main/20210414/code/IHME" 
.         di "`path'"
{res}/Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 {c -(}
.         local path "C:\Users\\`usrnam'\Downloads\globalcovid-main\20210414\code\IHME"
.         di "`path'"
. {c )-}
{txt}
{com}. *
. 
. * set local folderList and dir (for the latest estimates)
. 
. 
. local folderList : dir "`path'" dirs "2021_*"
{txt}
{com}. 
. 
. 
. foreach folder of local folderList {c -(}
{txt}  2{com}. 
.     di "`folder'"
{txt}  3{com}.         
.         * get reference_hospitalization_all_locs
.         
.         if regexm(c(os),"Mac") == 1 {c -(}
{txt}  4{com}.         import delimited using "`path'/`folder'/reference_hospitalization_all_locs.csv", clear varnames(1)
{txt}  5{com}.         save "$pathglobalcovid/IHME/Reference_hospitalization_all_locs.dta", replace
{txt}  6{com}.         {c )-}
{txt}  7{com}.         else if regexm(c(os),"Windows") == 1 {c -(}
{txt}  8{com}.         import delimited using "`path'\\`folder'\reference_hospitalization_all_locs.csv", clear varnames(1)
{txt}  9{com}.         capture save "$pathglobalcovid\IHME\Reference_hospitalization_all_locs.dta", replace
{txt} 10{com}.         {c )-}
{txt} 11{com}.         
.         
.         * get best_masks_hospitalization_all_locs
.         
.         if regexm(c(os),"Mac") == 1 {c -(}
{txt} 12{com}.         import delimited using "`path'/`folder'/best_masks_hospitalization_all_locs.csv", clear varnames(1)
{txt} 13{com}.         save "$pathglobalcovid/IHME/Best_masks_hospitalization_all_locs.dta", replace
{txt} 14{com}.         {c )-}
{txt} 15{com}.         else if regexm(c(os),"Windows") == 1 {c -(}
{txt} 16{com}.         import delimited using "`path'\\`folder'\best_masks_hospitalization_all_locs.csv", clear varnames(1)
{txt} 17{com}.         capture save "$pathglobalcovid\IHME\Best_masks_hospitalization_all_locs.dta", replace
{txt} 18{com}.         {c )-}
{txt} 19{com}.         
.         
.         * get worse_hospitalization_all_locs
.         
.         if regexm(c(os),"Mac") == 1 {c -(}
{txt} 20{com}.         import delimited using "`path'/`folder'/worse_hospitalization_all_locs.csv", clear varnames(1)
{txt} 21{com}.         save "$pathglobalcovid/IHME/Worse_hospitalization_all_locs.dta", replace
{txt} 22{com}.         {c )-}
{txt} 23{com}.         else if regexm(c(os),"Windows") == 1 {c -(}
{txt} 24{com}.         import delimited using "`path'\\`folder'\worse_hospitalization_all_locs.csv", clear varnames(1)
{txt} 25{com}.         capture save "$pathglobalcovid\IHME\Worse_hospitalization_all_locs.dta", replace        
{txt} 26{com}.         {c )-}
{txt} 27{com}. *
. {c )-}
2021_04_09
{res}{text}(73 vars, 208,406 obs)
(note: file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code//IHME/Reference_hospitalization_all_locs.dta not found)
file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code//IHME/Reference_hospitalization_all_locs.dta saved
{res}{text}(51 vars, 208,406 obs)
(note: file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code//IHME/Best_masks_hospitalization_all_locs.dta not found)
file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code//IHME/Best_masks_hospitalization_all_locs.dta saved
{res}{text}(51 vars, 208,406 obs)
(note: file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code//IHME/Worse_hospitalization_all_locs.dta not found)
file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code//IHME/Worse_hospitalization_all_locs.dta saved

{com}. *
. 
. 
.         
. 
. 
. 
. ******************************
. 
. * read scenario files
. 
. 
. **********************
. 
. * S1 Reference
. 
. use "Reference_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Global")
{txt}(207,861 observations deleted)

{com}. 
. 
. * rename variables
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S01V03
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S01V03
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S01V03
{res}{txt}
{com}. label var TotDeaMeRaA02S01V03 "Total Deaths Mean not smoothed IHME S1"
{txt}
{com}. label var TotDeaLoRaA02S01V03 "Total Deaths Lower not smoothed IHME S1"
{txt}
{com}. label var TotDeaUpRaA02S01V03 "Total Deaths Upper not smoothed IHME S1"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S01V03
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S01V03
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S01V03
{res}{txt}
{com}. label var DayDeaMeRaA02S01V03 "Daily Deaths Mean not smoothed IHME S1"
{txt}
{com}. label var DayDeaLoRaA02S01V03 "Daily Deaths Lower not smoothed IHME S1"
{txt}
{com}. label var DayDeaUpRaA02S01V03 "Daily Deaths Upper not smoothed IHME S1"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S01V03
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S01V03
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S01V03
{res}{txt}
{com}. label var TotCasMeRaA02S01V03 "Total Cases Mean not smoothed IHME S1"
{txt}
{com}. label var TotCasLoRaA02S01V03 "Total Cases Lower not smoothed IHME S1"
{txt}
{com}. label var TotCasUpRaA02S01V03 "Total Cases Upper not smoothed IHME S1"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S01V03
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S01V03
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S01V03
{res}{txt}
{com}. label var DayCasMeRaA02S01V03 "Daily Cases Mean not smoothed IHME S1"
{txt}
{com}. label var DayCasLoRaA02S01V03 "Daily Cases Lower not smoothed IHME S1"
{txt}
{com}. label var DayCasUpRaA02S01V03 "Daily Cases Upper not smoothed IHME S1"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S01V03
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S01V03
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S01V03
{res}{txt}
{com}. label var TotDeaMeSmA02S01V03 "Total Deaths Mean smoothed IHME S1"
{txt}
{com}. label var TotDeaLoSmA02S01V03 "Total Deaths Lower smoothed IHME S1"
{txt}
{com}. label var TotDeaUpSmA02S01V03 "Total Deaths Upper smoothed IHME S1"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S01V03        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S01V03        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S01V03  
{res}{txt}
{com}. label var DayDeaMeSmA02S01V03 "Daily Deaths Mean smoothed IHME S1"
{txt}
{com}. label var DayDeaLoSmA02S01V03 "Daily Deaths Lower smoothed IHME S1"
{txt}
{com}. label var DayDeaUpSmA02S01V03 "Daily Deaths Upper smoothed IHME S1"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. * other outcomes 
. 
. /*
> allbed_mean             Mean covid beds needed by day
> allbed_lower    Lower uncertainty bound of covid beds needed by day
> allbed_upper    Upper uncertainty bound of covid beds needed by day
> icubed_mean             Mean ICU covid beds needed by day
> icubed_lower    Lower uncertainty bound of ICU covid beds needed by day
> icubed_upper    Upper uncertainty bound of ICU covid beds needed by day
> invven_mean             Mean invasive ventilation needed by day
> invven_lower    Lower uncertainty bound of invasive ventilation needed by day
> invven_upper    Upper uncertainty bound of invasive ventilation needed by day
> admis_mean              Mean hospital admissions by day
> admis_lower             Lower uncertainty bound of hospital admissions by day
> admis_upper             Upper uncertainty bound of hospital admissions by day
> newicu_mean             Mean number of new people going to the ICU by day
> newicu_lower    Lower uncertainty bound of the number of new people going to the ICU by day
> newicu_upper    Upper uncertainty bound of the number of new people going to the ICU by day
> bedover_mean    [covid all beds needed] - ([total bed capacity] - [average all bed usage])
> bedover_lower   Lower uncertainty bound of bedover (above)
> bedover_upper   Upper uncertainty bound of bedover (above)
> icuover_mean    [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage])
> icuover_lower   Lower uncertainty bound of icuover (above)
> icuover_upper   Upper uncertainty bound of icuover (above)
> 
> total_tests             Total tests
> 
> seroprev_mean
> seroprev_lower
> seroprev_upper  
> 
> 
> ***********************
> * rename convention
> 
> allbed          Bed     covid beds needed by day
> icubed          Icu     ICU covid beds needed by day
> invven          Ven     invasive ventilation needed by day
> admis           Adm     hospital admissions by day
> newicu          Icn             number of new people going to the ICU by day
> bedover         Beo             [covid all beds needed] - ([total bed capacity] - [average all bed usage])
> icuover         Ico             [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage])
> 
> total_tests             Tes     tests
> 
> seroprev_mean   Ser seroprevalence 
> 
> */
. 
. 
. rename allbed_mean              DayBedMeSmA02S01V03
{res}{txt}
{com}. rename allbed_lower             DayBedLoSmA02S01V03
{res}{txt}
{com}. rename allbed_upper             DayBedUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayBedMeSmA02S01V03 "Daily Beds needed Mean IHME S1"
{txt}
{com}. label var DayBedLoSmA02S01V03 "Daily Beds needed Lower IHME S1"
{txt}
{com}. label var DayBedUpSmA02S01V03 "Daily Beds needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename icubed_mean              DayIcuMeSmA02S01V03
{res}{txt}
{com}. rename icubed_lower             DayIcuLoSmA02S01V03
{res}{txt}
{com}. rename icubed_upper             DayIcuUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayIcuMeSmA02S01V03 "Daily ICU beds needed Mean IHME S1"
{txt}
{com}. label var DayIcuLoSmA02S01V03 "Daily ICU beds needed Lower IHME S1"
{txt}
{com}. label var DayIcuUpSmA02S01V03 "Daily ICU beds needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename invven_mean              DayVenMeSmA02S01V03
{res}{txt}
{com}. rename invven_lower             DayVenLoSmA02S01V03
{res}{txt}
{com}. rename invven_upper             DayVenUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayVenMeSmA02S01V03 "Daily invasive Ventilation needed Mean IHME S1"
{txt}
{com}. label var DayVenLoSmA02S01V03 "Daily invasive Ventilation needed Lower IHME S1"
{txt}
{com}. label var DayVenUpSmA02S01V03 "Daily invasive Ventilation needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename admis_mean               DayAdmMeSmA02S01V03
{res}{txt}
{com}. rename admis_lower              DayAdmLoSmA02S01V03
{res}{txt}
{com}. rename admis_upper              DayAdmUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayAdmMeSmA02S01V03 "Daily hospital admissions Mean IHME S1"
{txt}
{com}. label var DayAdmLoSmA02S01V03 "Daily hospital admissions Lower IHME S1"
{txt}
{com}. label var DayAdmUpSmA02S01V03 "Daily hospital admissions Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename newicu_mean              DayIcnMeSmA02S01V03
{res}{txt}
{com}. rename newicu_lower             DayIcnLoSmA02S01V03
{res}{txt}
{com}. rename newicu_upper             DayIcnUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayIcnMeSmA02S01V03 "Daily new people going to ICU Mean IHME S1"
{txt}
{com}. label var DayIcnLoSmA02S01V03 "Daily new people going to ICU Lower IHME S1"
{txt}
{com}. label var DayIcnUpSmA02S01V03 "Daily new people going to ICU Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename bedover_mean                     DayBeoMeSmA02S01V03
{res}{txt}
{com}. rename bedover_lower            DayBeoLoSmA02S01V03
{res}{txt}
{com}. rename bedover_upper            DayBeoUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayBeoMeSmA02S01V03 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Mean IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayBeoLoSmA02S01V03 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Lower IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayBeoUpSmA02S01V03 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Upper IHME S1"
{txt}note: label truncated to 80 characters

{com}. 
. 
. 
. rename icuover_mean                     DayIcoMeSmA02S01V03
{res}{txt}
{com}. rename icuover_lower            DayIcoLoSmA02S01V03
{res}{txt}
{com}. rename icuover_upper            DayIcoUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayIcoMeSmA02S01V03 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Mean IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayIcoLoSmA02S01V03 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Lower IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayIcoUpSmA02S01V03 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Upper IHME S1"
{txt}note: label truncated to 80 characters

{com}. 
. 
. 
. rename total_tests TotTesMeSmA02S01V03
{res}{txt}
{com}. 
. label var TotTesMeSmA02S01V03 "Total Tests Mean IHME S1"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S01V03
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S01V03
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S01V03
{res}{txt}
{com}. 
. label var TotSerMeSmA02S01V03 "Total seroprevalence Mean IHME S1"
{txt}
{com}. label var TotSerLoSmA02S01V03 "Total seroprevalence Lower IHME S1"
{txt}
{com}. label var TotSerUpSmA02S01V03 "Total seroprevalence Upper IHME S1"
{txt}
{com}. 
. 
. save "Reference global.dta", replace
{txt}(note: file Reference global.dta not found)
file Reference global.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. * S2 Best
. 
. use "Best_masks_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Global")
{txt}(207,861 observations deleted)

{com}. 
. 
. * rename variables
. 
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S02V03
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S02V03
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S02V03
{res}{txt}
{com}. label var TotDeaMeRaA02S02V03 "Total Deaths Mean not smoothed IHME S2"
{txt}
{com}. label var TotDeaLoRaA02S02V03 "Total Deaths Lower not smoothed IHME S2"
{txt}
{com}. label var TotDeaUpRaA02S02V03 "Total Deaths Upper not smoothed IHME S2"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S02V03
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S02V03
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S02V03
{res}{txt}
{com}. label var DayDeaMeRaA02S02V03 "Daily Deaths Mean not smoothed IHME S2"
{txt}
{com}. label var DayDeaLoRaA02S02V03 "Daily Deaths Lower not smoothed IHME S2"
{txt}
{com}. label var DayDeaUpRaA02S02V03 "Daily Deaths Upper not smoothed IHME S2"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S02V03
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S02V03
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S02V03
{res}{txt}
{com}. label var TotCasMeRaA02S02V03 "Total Cases Mean not smoothed IHME S2"
{txt}
{com}. label var TotCasLoRaA02S02V03 "Total Cases Lower not smoothed IHME S2"
{txt}
{com}. label var TotCasUpRaA02S02V03 "Total Cases Upper not smoothed IHME S2"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S02V03
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S02V03
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S02V03
{res}{txt}
{com}. label var DayCasMeRaA02S02V03 "Daily Cases Mean not smoothed IHME S2"
{txt}
{com}. label var DayCasLoRaA02S02V03 "Daily Cases Lower not smoothed IHME S2"
{txt}
{com}. label var DayCasUpRaA02S02V03 "Daily Cases Upper not smoothed IHME S2"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S02V03
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S02V03
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S02V03
{res}{txt}
{com}. label var TotDeaMeSmA02S02V03 "Total Deaths Mean smoothed IHME S2"
{txt}
{com}. label var TotDeaLoSmA02S02V03 "Total Deaths Lower smoothed IHME S2"
{txt}
{com}. label var TotDeaUpSmA02S02V03 "Total Deaths Upper smoothed IHME S2"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S02V03        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S02V03        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S02V03  
{res}{txt}
{com}. label var DayDeaMeSmA02S02V03 "Daily Deaths Mean smoothed IHME S2"
{txt}
{com}. label var DayDeaLoSmA02S02V03 "Daily Deaths Lower smoothed IHME S2"
{txt}
{com}. label var DayDeaUpSmA02S02V03 "Daily Deaths Upper smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. * other outcomes
. 
. 
. rename total_tests TotTesMeSmA02S02V03
{res}{txt}
{com}. 
. label var TotTesMeSmA02S02V03 "Total Tests Mean IHME S2"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S02V03
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S02V03
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S02V03
{res}{txt}
{com}. 
. label var TotSerMeSmA02S02V03 "Total seroprevalence Mean IHME S2"
{txt}
{com}. label var TotSerLoSmA02S02V03 "Total seroprevalence Lower IHME S2"
{txt}
{com}. label var TotSerUpSmA02S02V03 "Total seroprevalence Upper IHME S2"
{txt}
{com}. 
. 
. save "Best global.dta", replace
{txt}(note: file Best global.dta not found)
file Best global.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. * S3 Worse
. 
. use "Worse_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Global")
{txt}(207,861 observations deleted)

{com}. 
. 
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S03V03
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S03V03
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S03V03
{res}{txt}
{com}. label var TotDeaMeRaA02S03V03 "Total Deaths Mean not smoothed IHME S3"
{txt}
{com}. label var TotDeaLoRaA02S03V03 "Total Deaths Lower not smoothed IHME S3"
{txt}
{com}. label var TotDeaUpRaA02S03V03 "Total Deaths Upper not smoothed IHME S3"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S03V03
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S03V03
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S03V03
{res}{txt}
{com}. label var DayDeaMeRaA02S03V03 "Daily Deaths Mean not smoothed IHME S3"
{txt}
{com}. label var DayDeaLoRaA02S03V03 "Daily Deaths Lower not smoothed IHME S3"
{txt}
{com}. label var DayDeaUpRaA02S03V03 "Daily Deaths Upper not smoothed IHME S3"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S03V03
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S03V03
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S03V03
{res}{txt}
{com}. label var TotCasMeRaA02S03V03 "Total Cases Mean not smoothed IHME S3"
{txt}
{com}. label var TotCasLoRaA02S03V03 "Total Cases Lower not smoothed IHME S3"
{txt}
{com}. label var TotCasUpRaA02S03V03 "Total Cases Upper not smoothed IHME S3"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S03V03
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S03V03
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S03V03
{res}{txt}
{com}. label var DayCasMeRaA02S03V03 "Daily Cases Mean not smoothed IHME S3"
{txt}
{com}. label var DayCasLoRaA02S03V03 "Daily Cases Lower not smoothed IHME S3"
{txt}
{com}. label var DayCasUpRaA02S03V03 "Daily Cases Upper not smoothed IHME S3"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S03V03
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S03V03
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S03V03
{res}{txt}
{com}. label var TotDeaMeSmA02S03V03 "Total Deaths Mean smoothed IHME S3"
{txt}
{com}. label var TotDeaLoSmA02S03V03 "Total Deaths Lower smoothed IHME S3"
{txt}
{com}. label var TotDeaUpSmA02S03V03 "Total Deaths Upper smoothed IHME S3"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S03V03        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S03V03        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S03V03  
{res}{txt}
{com}. label var DayDeaMeSmA02S03V03 "Daily Deaths Mean smoothed IHME S3"
{txt}
{com}. label var DayDeaLoSmA02S03V03 "Daily Deaths Lower smoothed IHME S3"
{txt}
{com}. label var DayDeaUpSmA02S03V03 "Daily Deaths Upper smoothed IHME S3"
{txt}
{com}. 
. 
. * other outcomes
. 
. rename total_tests TotTesMeSmA02S03V03
{res}{txt}
{com}. 
. label var TotTesMeSmA02S03V03 "Total Tests Mean IHME S3"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S03V03
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S03V03
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S03V03
{res}{txt}
{com}. 
. label var TotSerMeSmA02S03V03 "Total seroprevalence Mean IHME S3"
{txt}
{com}. label var TotSerLoSmA02S03V03 "Total seroprevalence Lower IHME S3"
{txt}
{com}. label var TotSerUpSmA02S03V03 "Total seroprevalence Upper IHME S3"
{txt}
{com}. 
. 
. 
. save "Worse global.dta", replace
{txt}(note: file Worse global.dta not found)
file Worse global.dta saved

{com}. 
. 
.  
.  
.  
.  
. **********************
. 
.  
. * merge scenario files
. 
. 
. use "Reference global.dta", clear
{txt}
{com}. merge 1:1 location_name date using "Best global.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             545{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. merge 1:1 location_name date using "Worse global.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             545{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21949{txt},{res}22493{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04feb2020{txt},{res}01aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}545{col 51}{txt}missing .:  {res}0{txt}/{res}545

{txt}{col 19}mean:{res}{col 26}   22221{txt} = {res}02nov2020{txt}
{col 15}std. dev:{res}{col 26} 157.472

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22003{col 37}   22085{col 47}   22221{col 57}   22357{col 67}   22439
{col 26}29mar2020{col 36}19jun2020{col 46}02nov2020{col 56}18mar2021{col 66}08jun2021
{txt}
{com}. drop year month day date2
{txt}
{com}. 
. 
. 
. rename location_name loc_grand_name
{res}{txt}
{com}. 
. replace loc_grand_name = "global"
{txt}(545 real changes made)

{com}. 
. 
. 
. 
. drop date_original v1 hosp_data_type deaths_data_type ///
> mobility_data_type mobility_composite ///
> confirmed_infections_data_type confirmed_infections est_infections_data_type ///
> total_pop seroprev_data_type
{txt}
{com}. 
. order deaths_mean_p100k_rate-est_infections_upper_p100k_rate, last
{txt}
{com}. 
. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}location_id{sf} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str48{sf}{txt} now {bf}{res}str6{sf}
{txt}  (25,615 bytes saved)

{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA02S01V03 = 100 * DayDeaMeRaA02S01V03 / DayCasMeRaA02S01V03
{txt}
{com}. gen DayCfrLoRaA02S01V03 = 100 * DayDeaLoRaA02S01V03 / DayCasLoRaA02S01V03
{txt}
{com}. gen DayCfrUpRaA02S01V03 = 100 * DayDeaUpRaA02S01V03 / DayCasUpRaA02S01V03
{txt}
{com}. gen DayCfrMeRaA02S02V03 = 100 * DayDeaMeRaA02S02V03 / DayCasMeRaA02S02V03
{txt}(424 missing values generated)

{com}. gen DayCfrLoRaA02S02V03 = 100 * DayDeaLoRaA02S02V03 / DayCasLoRaA02S02V03
{txt}(424 missing values generated)

{com}. gen DayCfrUpRaA02S02V03 = 100 * DayDeaUpRaA02S02V03 / DayCasUpRaA02S02V03
{txt}(424 missing values generated)

{com}. gen DayCfrMeRaA02S03V03 = 100 * DayDeaMeRaA02S03V03 / DayCasMeRaA02S03V03
{txt}(424 missing values generated)

{com}. gen DayCfrLoRaA02S03V03 = 100 * DayDeaLoRaA02S03V03 / DayCasLoRaA02S03V03
{txt}(424 missing values generated)

{com}. gen DayCfrUpRaA02S03V03 = 100 * DayDeaUpRaA02S03V03 / DayCasUpRaA02S03V03
{txt}(424 missing values generated)

{com}. 
. label var DayCfrMeRaA02S01V03 "Daily CFR Mean Raw IHME S1" 
{txt}
{com}. label var DayCfrLoRaA02S01V03 "Daily CFR Lower Raw IHME S1" 
{txt}
{com}. label var DayCfrUpRaA02S01V03 "Daily CFR Upper Raw IHME S1" 
{txt}
{com}. label var DayCfrMeRaA02S02V03 "Daily CFR Mean Raw IHME S2" 
{txt}
{com}. label var DayCfrLoRaA02S02V03 "Daily CFR Lower Raw IHME S2" 
{txt}
{com}. label var DayCfrUpRaA02S02V03 "Daily CFR Upper Raw IHME S2" 
{txt}
{com}. label var DayCfrMeRaA02S03V03 "Daily CFR Mean Raw IHME S3" 
{txt}
{com}. label var DayCfrLoRaA02S03V03 "Daily CFR Lower Raw IHME S3" 
{txt}
{com}. label var DayCfrUpRaA02S03V03 "Daily CFR Upper Raw IHME S3" 
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. label var deaths_mean_p100k_rate "Daily deaths mean raw per 100k rate IHME"
{txt}
{com}. 
. label var deaths_lower_p100k_rate "Daily deaths lower raw per 100k rate IHME"
{txt}
{com}. 
. label var deaths_upper_p100k_rate "Daily deaths upper raw per 100k rate IHME"
{txt}
{com}. 
. label var totdea_mean_p100k_rate "Total deaths mean per raw 100k rate IHME"
{txt}
{com}. 
. label var totdea_lower_p100k_rate "Total deaths mean per raw 100k rate IHME"
{txt}
{com}. 
. label var totdea_upper_p100k_rate "Total deaths upper per raw 100k rate IHME"
{txt}
{com}. 
. label var deaths_mean_smoothed_p100k_rate "Daily deaths mean smoothed per 100k rate IHME"
{txt}
{com}. 
. label var deaths_lower_smoothed_p100k_rate "Daily deaths lower smoothed per 100k rate IHME"
{txt}
{com}. 
. label var deaths_upper_smoothed_p100k_rate "Daily deaths upper smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_mean_smoothed_p100k_rate "Total deaths mean smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_lower_smoothed_p100k_rate "Total deaths lower smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_upper_smoothed_p100k_rate "Total deaths upper smoothed per 100k rate IHME"
{txt}
{com}. 
. label var confirmed_infections_p100k_rate  "confirmed infections per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_mean_p100k_rate "estimated infections mean per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_lower_p100k_rate "estimated infections lower per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_upper_p100k_rate "estimated infections upper per 100k rate IHME"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean IHME DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
.         summ DayDeaMeSmA02S01V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeSm.. {c |}{res}        545    8684.989    4315.232   86.50814   17251.49
{txt}
{com}.         gen DayDeMMeSmA02S01V03 = r(mean)
{txt}
{com}.         label var DayDeMMeSmA02S01V03 "Daily deaths mean IHME DayDeM"
{txt}
{com}. 
.         summ DayCasMeRaA02S01V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}        545     2643844     1310903   14369.34    5145056
{txt}
{com}.         gen DayCaMMeRaA02S01V03 = r(mean)
{txt}
{com}.         label var DayCaMMeRaA02S01V03 "Daily cases mean IHME DayCaM"
{txt}
{com}.                            
.         gen DayCbDMeRaA02S01V03 = DayCaMMeRaA02S01V03 / DayDeMMeSmA02S01V03
{txt}
{com}.         label var DayCbDMeRaA02S01V03 "Daily cases mean div by daily deaths mean IHME DayCbD"
{txt}
{com}.         summ DayCbDMeRaA02S01V03

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~03 {c |}{res}        545    304.4153           0   304.4153   304.4153
{txt}
{com}.                                               
.         gen DayDMuMeRaA02S01V03 = DayDeaMeRaA02S01V03 * DayCbDMeRaA02S01V03
{txt}
{com}.     label var DayDMuMeRaA02S01V03 "Daily deaths scaled (times means of cases by deaths) IHME"
{txt}
{com}.         summ DayDMuMeRaA02S01V03

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~03 {c |}{res}        545     2621465     1352551   608.8306    5659937
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. ***********************
. 
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. * daily deaths
. 
. 
. * daily deaths, medain scenario = S1       
.            
.            
. twoway (rarea DayDeaLoSmA02S01V03 DayDeaUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 1 COVID-19 daily deaths, reference scenario, global, IHME.gph", replace
{txt}(note: file graph 1 COVID-19 daily deaths, reference scenario, global, IHME.gph not found)
{res}{txt}(file graph 1 COVID-19 daily deaths, reference scenario, global, IHME.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, reference scenario, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 1 COVID-19 daily deaths, reference scenario, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, 3 scenarios  
.   
.   
. twoway ///
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayDeaMeSmA02S02V03 date, sort lcolor(green)) ///
> (line DayDeaMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 2 COVID-19 daily deaths, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 2 COVID-19 daily deaths, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 2 COVID-19 daily deaths, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 2 COVID-19 daily deaths, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 2 COVID-19 daily deaths, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, medain scenario = S1, CI
.   
.   
. twoway ///
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S01V03 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 daily deaths, global median scenario CI, IHME.gph", replace
{txt}(note: file graph 3 COVID-19 daily deaths, global median scenario CI, IHME.gph not found)
{res}{txt}(file graph 3 COVID-19 daily deaths, global median scenario CI, IHME.gph saved)

{com}. graph export "graph 3 COVID-19 daily deaths, global median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 3 COVID-19 daily deaths, global median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, best scenario = S2, CI
.   
.   
. twoway ///
> (line DayDeaMeSmA02S02V03 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S02V03 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S02V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 4 COVID-19 daily deaths, global best scenario CI, IHME.gph", replace
{txt}(note: file graph 4 COVID-19 daily deaths, global best scenario CI, IHME.gph not found)
{res}{txt}(file graph 4 COVID-19 daily deaths, global best scenario CI, IHME.gph saved)

{com}. graph export "graph 4 COVID-19 daily deaths, global best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 4 COVID-19 daily deaths, global best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, worst scenario = S3, CI
.   
.   
. twoway ///
> (line DayDeaMeSmA02S03V03 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S03V03 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 5 COVID-19 daily deaths, global worst scenario CI, IHME.gph", replace
{txt}(note: file graph 5 COVID-19 daily deaths, global worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 5 COVID-19 daily deaths, global worst scenario CI, IHME.gph saved)

{com}. graph export "graph 5 COVID-19 daily deaths, global worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 5 COVID-19 daily deaths, global worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. * daily cases
. 
. 
. * daily cases, medain scenario = S1        
.            
.            
. twoway (rarea DayCasLoRaA02S01V03 DayCasUpRaA02S01V03 date, sort color(black*.2)) ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 6 COVID-19 daily cases, reference scenario, global, IHME.gph", replace
{txt}(note: file graph 6 COVID-19 daily cases, reference scenario, global, IHME.gph not found)
{res}{txt}(file graph 6 COVID-19 daily cases, reference scenario, global, IHME.gph saved)

{com}. graph export "graph 6 COVID-19 daily cases, reference scenario, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 6 COVID-19 daily cases, reference scenario, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, 3 scenarios  
.   
.   
. twoway ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayCasMeRaA02S02V03 date, sort lcolor(green)) ///
> (line DayCasMeRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 7 COVID-19 daily cases, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 7 COVID-19 daily cases, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 7 COVID-19 daily cases, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 7 COVID-19 daily cases, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 7 COVID-19 daily cases, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, medain scenario = S1, CI
.   
.   
. twoway ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S01V03 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 8 COVID-19 daily cases, global median scenario CI, IHME.gph", replace
{txt}(note: file graph 8 COVID-19 daily cases, global median scenario CI, IHME.gph not found)
{res}{txt}(file graph 8 COVID-19 daily cases, global median scenario CI, IHME.gph saved)

{com}. graph export "graph 8 COVID-19 daily cases, global median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 8 COVID-19 daily cases, global median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, best scenario = S2, CI
.   
.   
. twoway ///
> (line DayCasMeRaA02S02V03 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S02V03 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S02V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 9 COVID-19 daily cases, global best scenario CI, IHME.gph", replace
{txt}(note: file graph 9 COVID-19 daily cases, global best scenario CI, IHME.gph not found)
{res}{txt}(file graph 9 COVID-19 daily cases, global best scenario CI, IHME.gph saved)

{com}. graph export "graph 9 COVID-19 daily cases, global best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 9 COVID-19 daily cases, global best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, worst scenario = S3, CI
.   
.   
. twoway ///
> (line DayCasMeRaA02S03V03 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S03V03 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 10 COVID-19 daily cases, global worst scenario CI, IHME.gph", replace
{txt}(note: file graph 10 COVID-19 daily cases, global worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 10 COVID-19 daily cases, global worst scenario CI, IHME.gph saved)

{com}. graph export "graph 10 COVID-19 daily cases, global worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 10 COVID-19 daily cases, global worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths
. 
. 
. * total deaths, medain scenario = S1       
.            
.            
. twoway (rarea TotDeaLoSmA02S01V03 TotDeaUpSmA02S01V03 date, sort color(black*.2)) ///
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 11 COVID-19 total deaths, reference scenario, global, IHME.gph", replace
{txt}(note: file graph 11 COVID-19 total deaths, reference scenario, global, IHME.gph not found)
{res}{txt}(file graph 11 COVID-19 total deaths, reference scenario, global, IHME.gph saved)

{com}. graph export "graph 11 COVID-19 total deaths, reference scenario, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 11 COVID-19 total deaths, reference scenario, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, 3 scenarios  
.   
.   
. twoway ///
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line TotDeaMeSmA02S02V03 date, sort lcolor(green)) ///
> (line TotDeaMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 12 COVID-19 total deaths, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 12 COVID-19 total deaths, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 12 COVID-19 total deaths, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 12 COVID-19 total deaths, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 12 COVID-19 total deaths, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, medain scenario = S1, CI
.   
.   
. twoway ///
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S01V03 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 13 COVID-19 total deaths, global median scenario CI, IHME.gph", replace
{txt}(note: file graph 13 COVID-19 total deaths, global median scenario CI, IHME.gph not found)
{res}{txt}(file graph 13 COVID-19 total deaths, global median scenario CI, IHME.gph saved)

{com}. graph export "graph 13 COVID-19 total deaths, global median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 13 COVID-19 total deaths, global median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, best scenario = S2, CI
.   
.   
. twoway ///
> (line TotDeaMeSmA02S02V03 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S02V03 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S02V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 14 COVID-19 total deaths, global best scenario CI, IHME.gph", replace
{txt}(note: file graph 14 COVID-19 total deaths, global best scenario CI, IHME.gph not found)
{res}{txt}(file graph 14 COVID-19 total deaths, global best scenario CI, IHME.gph saved)

{com}. graph export "graph 14 COVID-19 total deaths, global best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 14 COVID-19 total deaths, global best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, worst scenario = S3, CI
.   
.   
. twoway ///
> (line TotDeaMeSmA02S03V03 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S03V03 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 15 COVID-19 total deaths, global worst scenario CI, IHME.gph", replace
{txt}(note: file graph 15 COVID-19 total deaths, global worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 15 COVID-19 total deaths, global worst scenario CI, IHME.gph saved)

{com}. graph export "graph 15 COVID-19 total deaths, global worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 15 COVID-19 total deaths, global worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total cases
. 
. 
. * total cases, medain scenario = S1        
.            
.            
. twoway (rarea TotCasLoRaA02S01V03 TotCasUpRaA02S01V03 date, sort color(black*.2)) ///
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 16 COVID-19 total cases, reference scenario, global, IHME.gph", replace
{txt}(note: file graph 16 COVID-19 total cases, reference scenario, global, IHME.gph not found)
{res}{txt}(file graph 16 COVID-19 total cases, reference scenario, global, IHME.gph saved)

{com}. graph export "graph 16 COVID-19 total cases, reference scenario, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 16 COVID-19 total cases, reference scenario, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, 3 scenarios  
.   
.   
. twoway ///
> (line TotCasMeRaA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line TotCasMeRaA02S02V03 date, sort lcolor(green)) ///
> (line TotCasMeRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 17 COVID-19 total cases, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 17 COVID-19 total cases, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 17 COVID-19 total cases, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 17 COVID-19 total cases, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 17 COVID-19 total cases, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, medain scenario = S1, CI
.   
.   
. twoway ///
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) ///
> (line TotCasLoRaA02S01V03 date, sort lcolor(green)) ///
> (line TotCasUpRaA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 18 COVID-19 total cases, global median scenario CI, IHME.gph", replace
{txt}(note: file graph 18 COVID-19 total cases, global median scenario CI, IHME.gph not found)
{res}{txt}(file graph 18 COVID-19 total cases, global median scenario CI, IHME.gph saved)

{com}. graph export "graph 18 COVID-19 total cases, global median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 18 COVID-19 total cases, global median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, best scenario = S2, CI, not available
.  
. 
. * total cases, worst scenario = S3, CI, not available
.   
.   
. 
. 
. 
. * cfr
. 
. 
. 
. 
. * daily cfr, 3 scenarios  
.   
.   
. twoway ///
> (line DayCfrMeRaA02S01V03 date, sort lcolor(black)) ///
> (line DayCfrMeRaA02S02V03 date, sort lcolor(green)) ///
> (line DayCfrMeRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 21 COVID-19 daily CFR, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 21 COVID-19 daily CFR, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 21 COVID-19 daily CFR, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 21 COVID-19 daily CFR, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 21 COVID-19 daily CFR, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * other outcomes 
. 
. 
. * daily beds needed, only in S1
. 
. 
. twoway (rarea DayBedLoSmA02S01V03 DayBedUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayBedMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily beds needed) title("COVID-19 daily beds needed, global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. graph save "graph 22 COVID-19 daily beds needed, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 22 COVID-19 daily beds needed, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 22 COVID-19 daily beds needed, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 22 COVID-19 daily beds needed, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 22 COVID-19 daily beds needed, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * ICU beds needed, only in S1
. 
. 
. twoway (rarea DayIcuLoSmA02S01V03 DayIcuUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayIcuMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(ICU beds needed) title("COVID-19 daily ICU beds needed, global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 23 COVID-19 daily ICU beds needed, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 23 COVID-19 daily ICU beds needed, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 23 COVID-19 daily ICU beds needed, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 23 COVID-19 daily ICU beds needed, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 23 COVID-19 daily ICU beds needed, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily invasive ventilation needed, only in S1
. 
. 
. twoway (rarea DayVenLoSmA02S01V03 DayVenUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayVenMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily invasive ventilation needed) title("COVID-19 daily invasive ventilation global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 24 COVID-19 daily invasive ventilation needed, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 24 COVID-19 daily invasive ventilation needed, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 24 COVID-19 daily invasive ventilation needed, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 24 COVID-19 daily invasive ventilation needed, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 24 COVID-19 daily invasive ventilation needed, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily hospital admissions, only in S1
. 
. 
. twoway (rarea DayAdmLoSmA02S01V03 DayAdmUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayAdmMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospital admissions) title("COVID-19 daily hospital admissions global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 25 COVID-19 daily hospital admissions, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 25 COVID-19 daily hospital admissions, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 25 COVID-19 daily hospital admissions, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 26 COVID-19 daily hospital admissions, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 26 COVID-19 daily hospital admissions, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily new people going to ICU
. 
. twoway (rarea DayIcnLoSmA02S01V03 DayIcnUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayIcnMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily new people going to ICU) title("COVID-19 daily new people going to ICU global, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 26 COVID-19 daily new people going to ICU, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 26 COVID-19 daily new people going to ICU, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 26 COVID-19 daily new people going to ICU, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 26 COVID-19 daily new people going to ICU, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 26 COVID-19 daily new people going to ICU, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily bed over 
. 
. 
. twoway (rarea DayBeoLoSmA02S01V03 DayBeoUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayBeoMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily bed over) title("COVID-19 daily bed over, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 27 COVID-19 daily bed over, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 27 COVID-19 daily bed over, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 27 COVID-19 daily bed over, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 27 COVID-19 daily bed over, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 27 COVID-19 daily bed over, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily ICU over (has same values as bed over)
. 
. 
. twoway (rarea DayIcoLoSmA02S01V03 DayIcoUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayIcoMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily ICU over) title("COVID-19 daily ICU over, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. graph save "graph 28 COVID-19 ICU over, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 28 COVID-19 ICU over, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 28 COVID-19 ICU over, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 28 COVID-19 ICU over global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 28 COVID-19 ICU over global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total tests
. 
. twoway ///
> (line TotTesMeSmA02S01V03 date, sort lcolor(black)) ///
> (line TotTesMeSmA02S02V03 date, sort lcolor(green)) ///
> (line TotTesMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total tests) title("COVID-19 total tests, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 29 COVID-19 total tests, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 29 COVID-19 total tests, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 29 COVID-19 total tests, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 29 COVID-19 total tests, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 29 COVID-19 total tests, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * seroprevalence
. 
. 
. twoway ///
> (line TotSerMeSmA02S01V03 date, sort lcolor(black)) ///
> (line TotSerMeSmA02S02V03 date, sort lcolor(green)) ///
> (line TotSerMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total seroprevalence) title("COVID-19 total seroprevalence, global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 30 COVID-19 total seroprevalence, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 30 COVID-19 total seroprevalence, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 30 COVID-19 total seroprevalence, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 30 COVID-19 total seroprevalence, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 30 COVID-19 total seroprevalence, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes
. 
. twoway ///
> (line DayBedMeSmA02S01V03 date, sort lcolor(black)) ///
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) ///
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) ///
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) ///
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) ///
> (line DayBeoMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Bed" 2 "ICU" 3 "Vent" 4 "Adm" 5 "ICU new" 6 "Bed over") rows(2))
{res}{txt}
{com}. 
. 
. graph save "graph 31 COVID-19 daily hospital-related outcomes, global median scenario, IHME.gph", replace
{txt}(note: file graph 31 COVID-19 daily hospital-related outcomes, global median scenario, IHME.gph not found)
{res}{txt}(file graph 31 COVID-19 daily hospital-related outcomes, global median scenario, IHME.gph saved)

{com}. graph export "graph 31 COVID-19 daily hospital-related outcomes, global median scenario, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 31 COVID-19 daily hospital-related outcomes, global median scenario, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes, wo beds needed 
. 
. twoway ///
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) ///
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) ///
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) ///
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) ///
> (line DayBeoMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "ICU" 2 "Vent" 3 "Adm" 4 "ICU new" 5 "Bedover") rows(1)) ///
> subtitle("without beds needed", size(small))
{res}{txt}
{com}. 
. 
. graph save "graph 32 COVID-19 daily hospital-related outcomes, global median scenario, IHME, wo beds needed.gph", replace
{txt}(note: file graph 32 COVID-19 daily hospital-related outcomes, global median scenario, IHME, wo beds needed.gph not found)
{res}{txt}(file graph 32 COVID-19 daily hospital-related outcomes, global median scenario, IHME, wo beds needed.gph saved)

{com}. graph export "graph 32 COVID-19 daily hospital-related outcomes, global median scenario, IHME, wo beds needed.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 32 COVID-19 daily hospital-related outcomes, global median scenario, IHME, wo beds needed.pdf written in PDF format)

{com}. 
. 
. 
. 
. * rates
. 
. * daily deaths raw per 100k rate
. 
. twoway ///
> (line deaths_mean_p100k_rate date, sort lcolor(black)) ///
> (line deaths_lower_p100k_rate date, sort lcolor(green)) ///
> (line deaths_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths per 100k rate) title("COVID-19 daily deaths raw per 100k rate, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 40 COVID-19 daily deaths raw per 100k rate, global, IHME.gph", replace
{txt}(note: file graph 40 COVID-19 daily deaths raw per 100k rate, global, IHME.gph not found)
{res}{txt}(file graph 40 COVID-19 daily deaths raw per 100k rate, global, IHME.gph saved)

{com}. graph export "graph 40 COVID-19 daily deaths raw per 100k rate, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 40 COVID-19 daily deaths raw per 100k rate, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths smoothed per 100k rate
. 
. twoway ///
> (line deaths_mean_smoothed_p100k_rate date, sort lcolor(black)) ///
> (line deaths_lower_smoothed_p100k_rate date, sort lcolor(green)) ///
> (line deaths_upper_smoothed_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths per 100k rate) title("COVID-19 daily deaths smoothed per 100k rate, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 41 COVID-19 daily deaths smoothed per 100k rate, global, IHME.gph", replace
{txt}(note: file graph 41 COVID-19 daily deaths smoothed per 100k rate, global, IHME.gph not found)
{res}{txt}(file graph 41 COVID-19 daily deaths smoothed per 100k rate, global, IHME.gph saved)

{com}. graph export "graph 41 COVID-19 daily deaths smoothed per 100k rate, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 41 COVID-19 daily deaths smoothed per 100k rate, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths raw per 100k rate
. 
. twoway ///
> (line totdea_mean_p100k_rate date, sort lcolor(black)) ///
> (line totdea_lower_p100k_rate date, sort lcolor(green)) ///
> (line totdea_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths per 100k rate) title("COVID-19 total deaths raw per 100k rate, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 42 COVID-19 total deaths raw per 100k rate, global, IHME.gph", replace
{txt}(note: file graph 42 COVID-19 total deaths raw per 100k rate, global, IHME.gph not found)
{res}{txt}(file graph 42 COVID-19 total deaths raw per 100k rate, global, IHME.gph saved)

{com}. graph export "graph 42 COVID-19 total deaths raw per 100k rate, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 42 COVID-19 total deaths raw per 100k rate, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths smoothed per 100k rate
. 
. twoway ///
> (line totdea_mean_smoothed_p100k_rate date, sort lcolor(black)) ///
> (line totdea_lower_smoothed_p100k_rate date, sort lcolor(green)) ///
> (line totdea_upper_smoothed_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths per 100k rate) title("COVID-19 total deaths smoothed per 100k rate, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 43 COVID-19 total deaths smoothed per 100k rate, global, IHME.gph", replace
{txt}(note: file graph 43 COVID-19 total deaths smoothed per 100k rate, global, IHME.gph not found)
{res}{txt}(file graph 43 COVID-19 total deaths smoothed per 100k rate, global, IHME.gph saved)

{com}. graph export "graph 43 COVID-19 total deaths smoothed per 100k rate, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 43 COVID-19 total deaths smoothed per 100k rate, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * estimated infections per 100k rate
. 
. twoway ///
> (line est_infections_mean_p100k_rate date, sort lcolor(black)) ///
> (line est_infections_lower_p100k_rate date, sort lcolor(green)) ///
> (line est_infections_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Estimated infections per 100k rate) title("COVID-19 estimated infections per 100k rate, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 estimated infections per 100k rate, global, IHME.gph", replace
{txt}(note: file graph 44 COVID-19 estimated infections per 100k rate, global, IHME.gph not found)
{res}{txt}(file graph 44 COVID-19 estimated infections per 100k rate, global, IHME.gph saved)

{com}. graph export "graph 44 COVID-19 estimated infections per 100k rate, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 44 COVID-19 estimated infections per 100k rate, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * confirmed infections per 100k rate
. 
. 
. twoway ///
> (line confirmed_infections_p100k_rate date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Confirmed infections per 100k rate) title("COVID-19 confirmed infections per 100k rate, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(off)
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 confirmed per 100k rate, global, IHME.gph", replace
{txt}(note: file graph 44 COVID-19 confirmed per 100k rate, global, IHME.gph not found)
{res}{txt}(file graph 44 COVID-19 confirmed per 100k rate, global, IHME.gph saved)

{com}. graph export "graph 44 COVID-19 confirmed per 100k rate, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/graph 44 COVID-19 confirmed per 100k rate, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. 
. twoway ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA02S01V03 date, sort lcolor(red)) ///
> (line DayDMuMeRaA02S01V03 date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, global, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. graph save "graph 45 COVID-19 daily deaths and cases global, IHME.gph", replace
{txt}(note: file graph 45 COVID-19 daily deaths and cases global, IHME.gph not found)
{res}{txt}(file graph 45 COVID-19 daily deaths and cases global, IHME.gph saved)

{com}. qui graph export "graph 45 COVID-19 daily deaths and cases global, IHME.pdf", replace
{txt}
{com}. 
. 
. 
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "global IHME.dta", replace
{txt}(note: file global IHME.dta not found)
file global IHME.dta saved

{com}. 
. 
. capture shell mv -f "2021_04_09" ~/.Trash
{txt}
{com}. 
. 
. 
. 
. view "log global IHME.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/globalcovid-main/20210414/code/IHME/log global IHME.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Apr 2021, 07:40:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}