{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal LANL.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-03-31
. ***************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 2021-03-31 (old), with 2021-03-31 (new) <<--       <<<--- * change update date here *
.                                                                                                          ***************************
.                                                                                                                                                                                                                  
.                                                                                                                                                                                                                  
. *******************
. 
. * Get LANL estimates 
. 
. clear 
{txt}
{com}. 
. 
. * download four files for four outcomes
. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-03-31/files/2021-03-31_global_cumulative_daily_cases_website.csv 2021-03-31_global_cumulative_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-03-31/files/2021-03-31_global_cumulative_daily_deaths_website.csv 2021-03-31_global_cumulative_daily_deaths_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-03-31/files/2021-03-31_global_incidence_daily_cases_website.csv 2021-03-31_global_incidence_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-03-31/files/2021-03-31_global_incidence_daily_deaths_website.csv 2021-03-31_global_incidence_daily_deaths_website.csv 
{txt}
{com}. 
. 
. *******************
. 
. * import csv files
. 
. 
. * Total Cases
. import delimited using "2021-03-31_global_cumulative_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 81,627 obs)

{com}. save "global_cumulative_daily_cases.dta", replace
{txt}file global_cumulative_daily_cases.dta saved

{com}. 
. * Total Deaths
. import delimited using "2021-03-31_global_cumulative_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 81,627 obs)

{com}. save "global_cumulative_daily_deaths.dta", replace
{txt}file global_cumulative_daily_deaths.dta saved

{com}. 
. * Daily Cases
. import delimited using "2021-03-31_global_incidence_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 81,627 obs)

{com}. save "global_incidence_daily_cases.dta", replace
{txt}file global_incidence_daily_cases.dta saved

{com}. 
. * Daily Deaths 
. import delimited using "2021-03-31_global_incidence_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 81,627 obs)

{com}. save "global_incidence_daily_deaths.dta", replace
{txt}file global_incidence_daily_deaths.dta saved

{com}.         
. 
. 
. 
. 
. *******************
. 
. * Total Cases
. 
. use "global_cumulative_daily_cases.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22418{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}18may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}483{col 51}{txt}missing .:  {res}0{txt}/{res}483

{txt}{col 19}mean:{res}{col 26}   22177{txt} = {res}19sep2020{txt}
{col 15}std. dev:{res}{col 26} 139.574

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21984{col 37}   22056{col 47}   22177{col 57}   22298{col 67}   22370
{col 26}10mar2020{col 36}21may2020{col 46}19sep2020{col 56}18jan2021{col 66}31mar2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotCasMeRaA04S00
{res}{txt}
{com}. rename q025 TotCasLoRaA04S00
{res}{txt}
{com}. rename q975 TotCasUpRaA04S00
{res}{txt}
{com}. 
. label var TotCasMeRaA04S00 "Total Cases Mean LANL S0"
{txt}
{com}. label var TotCasLoRaA04S00 "Total Cases Lower LANL S0"
{txt}
{com}. label var TotCasUpRaA04S00 "Total Cases Upper LANL S0"
{txt}
{com}. 
. save "global LANL Total Cases.dta", replace
{txt}file global LANL Total Cases.dta saved

{com}. 
. 
. 
. 
. 
. *******************
. 
. * Total Deaths
. 
. use "global_cumulative_daily_deaths.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22418{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}18may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}483{col 51}{txt}missing .:  {res}0{txt}/{res}483

{txt}{col 19}mean:{res}{col 26}   22177{txt} = {res}19sep2020{txt}
{col 15}std. dev:{res}{col 26} 139.574

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21984{col 37}   22056{col 47}   22177{col 57}   22298{col 67}   22370
{col 26}10mar2020{col 36}21may2020{col 46}19sep2020{col 56}18jan2021{col 66}31mar2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotDeaMeRaA04S00
{res}{txt}
{com}. rename q025 TotDeaLoRaA04S00
{res}{txt}
{com}. rename q975 TotDeaUpRaA04S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA04S00 "Total deaths Mean LANL S0"
{txt}
{com}. label var TotDeaLoRaA04S00 "Total deaths Lower LANL S0"
{txt}
{com}. label var TotDeaUpRaA04S00 "Total deaths Upper LANL S0"
{txt}
{com}. 
. 
. save "global LANL Total Deaths.dta", replace
{txt}file global LANL Total Deaths.dta saved

{com}. 
. 
. 
. 
. 
. 
. *******************
. 
. * Daily Cases
. 
. use "global_incidence_daily_cases.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22418{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}18may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}483{col 51}{txt}missing .:  {res}0{txt}/{res}483

{txt}{col 19}mean:{res}{col 26}   22177{txt} = {res}19sep2020{txt}
{col 15}std. dev:{res}{col 26} 139.574

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21984{col 37}   22056{col 47}   22177{col 57}   22298{col 67}   22370
{col 26}10mar2020{col 36}21may2020{col 46}19sep2020{col 56}18jan2021{col 66}31mar2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayCasMeRaA04S00
{res}{txt}
{com}. rename q025 DayCasLoRaA04S00
{res}{txt}
{com}. rename q975 DayCasUpRaA04S00
{res}{txt}
{com}. 
. label var DayCasMeRaA04S00 "Daily cases Mean LANL S0"
{txt}
{com}. label var DayCasLoRaA04S00 "Daily cases Lower LANL S0"
{txt}
{com}. label var DayCasUpRaA04S00 "Daily cases Upper LANL S0"
{txt}
{com}. 
. 
. save "global LANL Daily Cases.dta", replace
{txt}file global LANL Daily Cases.dta saved

{com}. 
. 
. 
. 
. 
. 
. *******************
. 
. * Daily Deaths
. 
. use "global_incidence_daily_deaths.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22418{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}18may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}483{col 51}{txt}missing .:  {res}0{txt}/{res}483

{txt}{col 19}mean:{res}{col 26}   22177{txt} = {res}19sep2020{txt}
{col 15}std. dev:{res}{col 26} 139.574

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21984{col 37}   22056{col 47}   22177{col 57}   22298{col 67}   22370
{col 26}10mar2020{col 36}21may2020{col 46}19sep2020{col 56}18jan2021{col 66}31mar2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayDeaMeRaA04S00
{res}{txt}
{com}. rename q025 DayDeaLoRaA04S00
{res}{txt}
{com}. rename q975 DayDeaUpRaA04S00
{res}{txt}
{com}. 
. label var DayDeaMeRaA04S00 "Daily deaths Mean LANL S0"
{txt}
{com}. label var DayDeaLoRaA04S00 "Daily deaths Lower LANL S0"
{txt}
{com}. label var DayDeaUpRaA04S00 "Daily deaths Upper LANL S0"
{txt}
{com}. 
. 
. save "global LANL Daily Deaths.dta", replace
{txt}file global LANL Daily Deaths.dta saved

{com}. 
. 
. 
. 
. 
. ******************
. 
. * merge four estimates files
. 
. 
. use "global LANL Total Cases.dta", clear 
{txt}
{com}. 
. merge 1:1 date using "global LANL Total Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             483{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "global LANL Daily Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             483{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "global LANL Daily Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             483{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop date_original  
{txt}
{com}. 
. order ///
> TotDeaLoRaA04S00 TotDeaMeRaA04S00 TotDeaUpRaA04S00 ///
> DayDeaLoRaA04S00 DayDeaMeRaA04S00 DayDeaUpRaA04S00 ///
> TotCasLoRaA04S00 TotCasMeRaA04S00 TotCasUpRaA04S00 ///
> DayCasLoRaA04S00 DayCasMeRaA04S00 DayCasUpRaA04S00
{txt}
{com}. 
. order date name
{txt}
{com}. 
. rename name loc_grand_name
{res}{txt}
{com}. 
. 
. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA04S00 = 100 * DayDeaMeRaA04S00 / DayCasMeRaA04S00
{txt}
{com}. gen DayCfrLoRaA04S00 = 100 * DayDeaLoRaA04S00 / DayCasLoRaA04S00
{txt}
{com}. gen DayCfrUpRaA04S00 = 100 * DayDeaUpRaA04S00 / DayCasUpRaA04S00
{txt}
{com}. 
. label var DayCfrMeRaA04S00 "Daily CFR Mean LANL S0"
{txt}
{com}. label var DayCfrLoRaA04S00 "Daily CFR Lower LANL S0"
{txt}
{com}. label var DayCfrUpRaA04S00 "Daily CFR Upper LANL S0"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean LANL DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        483    6900.578    4111.786          1      17904
{txt}
{com}. gen DayDeMMeRaA04S00  = r(mean)
{txt}
{com}. label var DayDeMMeRaA04S00  "Daily deaths mean LANL DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA04S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        483    332793.7    244774.3         98    1497987
{txt}
{com}. gen DayCaMMeRaA04S00  = r(mean)
{txt}
{com}. label var DayCaMMeRaA04S00  "Daily cases mean LANL DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA04S00  = DayCaMMeRaA04S00  / DayDeMMeRaA04S00 
{txt}
{com}. label var DayCbDMeRaA04S00  "Daily cases mean div by daily deaths mean LANL DayCbD"
{txt}
{com}. summ DayCbDMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        483    48.22693           0   48.22693   48.22693
{txt}
{com}.                                               
. gen DayDMuMeRaA04S00  = DayDeaMeRaA04S00  * DayCbDMeRaA04S00 
{txt}
{com}. label var DayDMuMeRaA04S00  "Daily deaths scaled (times means of cases by deaths) LANL"
{txt}
{com}. summ DayDMuMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        483    332793.7    198298.8   48.22693     863455
{txt}
{com}. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. * daily deaths     
. 
. twoway (rarea DayDeaLoRaA04S00 DayDeaUpRaA04S00 date, sort color(green*.2)) ///
> (line DayDeaMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 1 COVID-19 daily deaths, global, LANL.gph", replace
{res}{txt}(file graph 1 COVID-19 daily deaths, global, LANL.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/graph 1 COVID-19 daily deaths, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases
. 
. twoway (rarea DayCasLoRaA04S00 DayCasUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCasMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 2 COVID-19 daily cases, global, LANL.gph", replace
{res}{txt}(file graph 2 COVID-19 daily cases, global, LANL.gph saved)

{com}. graph export "graph 2 COVID-19 daily cases, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/graph 2 COVID-19 daily cases, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths     
.            
. twoway (rarea TotDeaLoRaA04S00 TotDeaUpRaA04S00 date, sort color(green*.2)) ///
> (line TotDeaMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 3 COVID-19 total deaths, global, LANL.gph", replace
{res}{txt}(file graph 3 COVID-19 total deaths, global, LANL.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/graph 3 COVID-19 total deaths, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases      
.            
. twoway (rarea TotCasLoRaA04S00 TotCasUpRaA04S00 date, sort color(green*.2)) ///
> (line TotCasMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 4 COVID-19 total cases, global, LANL.gph", replace
{res}{txt}(file graph 4 COVID-19 total cases, global, LANL.gph saved)

{com}. graph export "graph 4 COVID-19 total cases, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/graph 4 COVID-19 total cases, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr
. 
. twoway (rarea DayCfrLoRaA04S00 DayCfrUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 5 COVID-19 daily CFR, global, LANL.gph", replace
{res}{txt}(file graph 5 COVID-19 daily CFR, global, LANL.gph saved)

{com}. graph export "graph 5 COVID-19 daily CFR, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/graph 5 COVID-19 daily CFR, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr, 01dec2020 on
. 
. twoway (rarea DayCfrLoRaA04S00 DayCfrUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00 date, sort lcolor(green)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#7, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}.            
. graph save "graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.gph", replace
{res}{txt}(file graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.gph saved)

{com}. graph export "graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. twoway ///
> (line DayCasMeRaA04S00  date, sort lcolor(blue)) ///
> (line DayDeaMeRaA04S00  date, sort lcolor(red)) ///
> (line DayDMuMeRaA04S00  date, sort lpattern(dot) lcolor(red)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, global, LANL", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 7 COVID-19 daily deaths and cases global, LANL.gph", replace
{txt}
{com}. qui graph export "graph 7 COVID-19 daily deaths and cases global, LANL.pdf", replace
{txt}
{com}. 
. 
. 
. 
. ****************
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. 
. save "CovidVisualizedGlobal LANL.dta", replace
{txt}file CovidVisualizedGlobal LANL.dta saved

{com}. 
. 
. 
. view "log CovidVisualizedGlobal LANL.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20210401/code/LANL/log CovidVisualizedGlobal LANL.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Jul 2021, 17:47:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}